In [16]:
import pandas as pd
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],'score': [12.5, 9, 16.5, 'np.nan', 9, 20, 14.5, 'np.nan', 8, 19],'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df= pd.DataFrame(exam_data,index=labels)

print(df)

        name   score  attempts qualify
a  Anastasia    12.5         1     yes
b       Dima       9         3      no
c  Katherine    16.5         2     yes
d      James  np.nan         3      no
e      Emily       9         2      no
f    Michael      20         3     yes
g    Matthew    14.5         1     yes
h      Laura  np.nan         1      no
i      Kevin       8         2      no
j      Jonas      19         1     yes

In [15]:
# question1
print(df.head(3))

        name score  attempts qualify
a  Anastasia  12.5         1     yes
b       Dima     9         3      no
c  Katherine  16.5         2     yes

In [41]:
# question 2
df1= df.drop(['d','h'])
print(df1)

        name score  attempts qualify
a  Anastasia  12.5         1     yes
b       Dima     9         3      no
c  Katherine  16.5         2     yes
e      Emily     9         2      no
f    Michael    20         3     yes
g    Matthew  14.5         1     yes
i      Kevin     8         2      no
j      Jonas    19         1     yes

In [48]:
# question 3
df2=df.drop(columns=['attempts','qualify'])
print(df2)

        name   score
a  Anastasia    12.5
b       Dima       9
c  Katherine    16.5
d      James  np.nan
e      Emily       9
f    Michael      20
g    Matthew    14.5
h      Laura  np.nan
i      Kevin       8
j      Jonas      19

In [84]:
# question 4
import pandas as pd
df3=pd.DataFrame({'name':["Suresh"],'score':[15.5],'attempts':[1],'qualify':["yes"]},index=['k'])
df.append(df3)

        name   score  attempts qualify
a  Anastasia    12.5         1     yes
b       Dima       9         3      no
c  Katherine    16.5         2     yes
d      James  np.nan         3      no
e      Emily       9         2      no
f    Michael      20         3     yes
g    Matthew    14.5         1     yes
h      Laura  np.nan         1      no
i      Kevin       8         2      no
j      Jonas      19         1     yes
k     Suresh    15.5         1     yes

In [60]:
# question 5
df4=df.drop(columns='attempts')
print(df4)

        name   score qualify
a  Anastasia    12.5     yes
b       Dima       9      no
c  Katherine    16.5     yes
d      James  np.nan      no
e      Emily       9      no
f    Michael      20     yes
g    Matthew    14.5     yes
h      Laura  np.nan      no
i      Kevin       8      no
j      Jonas      19     yes

In [83]:
# question 6
import numpy as np
conditions = [(df1['score'] > 10),(df1['score'] < 10)]
values = ['1', '0']
df1['Success'] = np.select(conditions, values)
df1

        name score  attempts qualify Success
a  Anastasia  12.5         1     yes       1
b       Dima     9         3      no       0
c  Katherine  16.5         2     yes       1
e      Emily     9         2      no       0
f    Michael    20         3     yes       1
g    Matthew  14.5         1     yes       1
i      Kevin     8         2      no       0
j      Jonas    19         1     yes       1

In [88]:
# question 7
df1.to_csv('My_data.csv')